export function AboutHe( {language} ) {
    return <section dir="rtl" >
        <section className='title'>
            <button className="button language" onClick={() => language(false)}>English</button>
            אודות המערכת</section>

        <section className="screen-continer ">
            <div className="side-bar">
                <ul className="list">
                    <li className="key">כללי</li>
                    <li className="key">משתמשים</li>
                    <li className="key">בקרת חדרים</li>
                    <li className="key">יומן אירועים</li>
                    <li className="key">עריכת אפליקציה</li>
                </ul>
            </div>
            <div className="text-continer">
                <p className="subtitle">כללי</p>
                <p className="txt">אפליקציית מערכת הבקרה, הינה הדמיה של מתחם בן ארבעה מגדלים כל אחד בן ארבעים קומות,
                    <br /> בכל קומה בקרת אקלים עבור האזורים והחדרים השונים.</p>

                <p className="subtitle">משתמשים</p>
                <div className="txt">המערכת מגיעה עם שלושה משתמשי ברירת מחדל:
                    <ul>
                        <li>View: משתמש לצפייה בלבד, אינו מורשה כלל לבצע שינויים.
                            <br />פרטי כניסה - "User name: "view", password: "1111
                        </li>
                        <br />
                        <li>Operator: משתמש המורשה לתפעל את המערכת אך אינו מורשה לבצע שינויי עריכה,
                            כגון הוספה ומחיקה של יחידות מיזוג או של משתמשים.
                            <br />פרטי כניסה - "User name: "operator" password: "2222
                        </li>
                        <br />
                        <li>Administrator: משתמש עם הרשאה כוללת לכל הפונקציות באפליקציה.
                            <br />פרטי כניסה - "User name: "admin", password: "3333
                        </li>
                    </ul>
                </div>

                <p className="subtitle">בקרת חדרים:</p>
                <p className="txt">מטרת המערכת לאפשר למתפעל לשלוט דרך האפליקציה על האקלים והפעלת המיזוג בכל חדר,
                    בכל קומה, בכל אחד מהבניינים במתחם.
                    <br />
                    <br />לכל יחידת מיזוג יש שורת תפעול המציגה את הטמפרטורה בחדר ואת סטטוס הפעולה.
                    בשורת התפעול ניתן לבצע, הפעלה וכיבוי של היחידה,
                    הגדרת טמפרטורה רצויה, בחירת מצב פעולה (חימום קירור וכו'), בחירת עוצמת מאוורר.
                    <br />
                    <br />כל התצוגות על המסך מתקבלות מבסיס הנתונים וכל הפקודות נשלחות לבסיס הנתונים,
                    המדמה כניסות ויציאות המתחברות למערכות מיזוג מציאותיות.
                    <br />
                    <br />בנוסף המערכת מתריעה על חריגה משמעותית בין הטמפרטורה הרצויה שהוגדרה לטמפרטורה בחדר,
                    המעידה על תקלה טכנית המצריכה טיפול של אנשי האחזקה.
                    לצורך כך ניתן להגדיר את הפרש הטמפרטורה ומשך הזמן עד להעלאת התרעה.
                    <br />
                    <br />לדוגמא: אם נגדיר טמפרטורה רצויה ℃ 20, הפרש טמפרטורה ℃ 3, זמן להתרעה 20 שניות,
                    אם הטמפרטורה בחדר תהיה ℃ 23 או יותר, למשך 20 שניות, המערכת תעלה התרעה.
                    תצוגת התרעה תופיע בשורת התפעול וכן תתווסף התרעה ליומן האירועים.
                    כאשר הטמפרטורה תשוב לטווח הרצוי,
                    תצוגת ההתרעה תעלם, והאירוע ביומן האירועים יעבור לסטטוס סגור (ע"ע).
                    <br />
                    <br />חשוב: מאחר ומדובר במערכת ווירטואלית, ובסיס הנתונים איננו מחובר למערכת מיזוג אמיתית,
                    הטמפרטורות המצויות מתקבלות באמצעות מחולל טמפרטורות חכם,
                    המדמה סיטואציה דומה למצבי אמת בחדרים ממוזגים.
                </p>

                <p className="subtitle">יומן אירועים</p>
                <p className="txt">בעריכה..............................</p>

                <p className="subtitle">עריכת אפליקציה</p>
                <p className="txt">בעריכה..............................</p>

            </div>
        </section>

    </section>

}