export function AboutHe({ language }) {
    return <section dir="rtl" >
        <section className='title'>
            <button className="button language" onClick={() => language(false)}>English</button>
            אודות המערכת</section>

        <section className="screen-continer ">
            <div className="side-bar">
                <ul className="list">
                    <li className="key">כללי</li>
                    <li className="key">משתמשים</li>
                    <li className="key">בקרת חדרים</li>
                    <li className="key">יומן אירועים</li>
                    <li className="key">עריכת אפליקציה</li>
                </ul>
            </div>
            <div className="text-continer">
                <p className="subtitle">כללי</p>
                <p className="txt">אפליקציית מערכת הבקרה, הינה הדמיה של מתחם עם ארבעה מגדלים, כל אחד בן ארבעים קומות,
                    <br /> בכל קומה בקרת אקלים ושליטה על מיזוג האוויר עבור האזורים והחדרים השונים.</p>

                <p className="subtitle">משתמשים</p>
                <div className="txt">המערכת מסופקת עם שלושה משתמשי ברירת מחדל:
                    <ul>
                        <li>View: משתמש לצפייה בלבד, אינו מורשה כלל לבצע שינויים.
                            <br />פרטי כניסה - "User name: "view", password: "1111
                        </li>
                        <br />
                        <li>Operator: משתמש המורשה לתפעל את המערכת באופן מלא אך אינו מורשה לבצע שינויי עריכה,
                            כגון הוספה ומחיקה של יחידות מיזוג או של משתמשים.
                            <br />פרטי כניסה - "User name: "operator" password: "2222
                        </li>
                        <br />
                        <li>Administrator: משתמש עם הרשאה גורפת לכל הפונקציות באפליקציה.
                            <br />פרטי כניסה - "User name: "admin", password: "3333
                        </li>
                    </ul>
                </div>

                <p className="subtitle">בקרת חדרים</p>
                <p className="txt">מטרת המערכת לאפשר למתפעל לשלוט דרך האפליקציה על האקלים והפעלת המיזוג
                    בכל חדר, בכל קומה, בכל אחד מהבניינים במתחם.
                    <br />
                    <br />לכל יחידת מיזוג יש שורת תפעול המציגה את הטמפרטורה בחדר ואת סטטוס הפעולה.
                    בשורת התפעול ניתן לבצע: הפעלה וכיבוי של היחידה,
                    הגדרת טמפרטורה רצויה, בחירת מצב פעולה (חימום קירור וכו'), בחירת עוצמת מאוורר.
                    <br />
                    <br />כל התצוגות על המסך מתקבלות מבסיס הנתונים וכל הפקודות נשלחות לבסיס הנתונים,
                    המדמה כניסות ויציאות או חיבור בתקשורת למערכות מיזוג מציאותיות.
                    <br />
                    <br />בנוסף המערכת מתריעה על חריגה משמעותית בין הטמפרטורה הרצויה שהוגדרה לטמפרטורה בחדר,
                    המעידה על תקלה טכנית המצריכה טיפול של צוות האחזקה.
                    לצורך כך יש להגדיר בשורת ההפעלה את הפרש הטמפרטורה ומשך הזמן עד להעלאת התרעה.
                    <br />
                    <br />לדוגמא: אם נגדיר טמפרטורה רצויה ℃ 20, הפרש טמפרטורה ℃ 3, זמן להתרעה 20 שניות,
                    :אם הטמפרטורה בחדר תעמוד על ℃ 23 או יותר, למשך 20 שניות, המערכת תעלה התרעה.
                    תצוגת התרעה תופיע בשורת התפעול והתרעה חדשה תתוסף ליומן האירועים.
                    כאשר הטמפרטורה תשוב לטווח הרצוי,
                    תצוגת ההתרעה תעלם, והאירוע ביומן האירועים יעבור לסטטוס סגור (ע"ע).
                    <br />
                    <br />חשוב: מאחר ומדובר במערכת ווירטואלית, דהיינו שבסיס הנתונים איננו מחובר למערכת מיזוג אמיתית,
                    טמפרטורות  החדרים המוצגות במסך נוצרות באמצעות מחולל טמפרטורות חכם,
                    המדמה סיטואציה המזכירה מצבי אמת בחדרים ממוזגים, כולל חריגות.
                </p>

                <p className="subtitle">יומן אירועים</p>
                <p className="txt">בעריכה..............................</p>

                <p className="subtitle">עריכת אפליקציה</p>
                <p className="txt">בעריכה..............................</p>

            </div>
        </section>

    </section>

}